[Killed] EqualityOperator
src/utilitarios.js:68:12
   }
 
   ehNumero(valor) {
-    return typeof valor === "number" && !isNaN(valor);
+    return typeof valor !== "number" && !isNaN(valor);
   }
 
killedBy: Utilitarios ehNumero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
