[Killed] EqualityOperator
src/banco.js:17:13
 
     // Método 2: Sacar dinheiro
     sacar(valor) {
-        if (valor > this.saldo) {
+        if (valor >= this.saldo) {
             throw new Error('Saldo insuficiente');
         }
killedBy: Classe Banco - Método sacar Sacar valor igual ao saldo
statusReason: Error: Saldo insuficiente

[Killed] ConditionalExpression
src/banco.js:73:34
     // Método 10: Obter o total depositado
     obterTotalDepositado() {
         return this.transacoes
-            .filter(transacao => transacao.tipo === 'Depósito')
+            .filter(transacao => true)
             .reduce((total, transacao) => total + transacao.valor, 0);
     }
killedBy: Classe Banco - Método obterTotalDepositado Obter o total depositado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: 65
